[
    {
        "id": 1,
        "name": "Porte Ouverte",
        "excerpt": "Les portes ouvertes de la HEPL vous permettra de visiter l’école de votre choix et de rencontrer les professeurs",
        "description": "La journée Porte Ouverte au Parc des Marêts aura lieu ce samedi 30 avril 2022. Lors de cette journée, vous pourrez rencontrer les professeurs de l’option, des anciens étudiants qui seront présents pour parler de leur expériences mais également tout l’équipe pédagogique. Vous pourrez parler avec eux et posez toutes vos questions.\n\nNous espérons vous y voir nombreux ! ",
        "lieu": "Liège",
        "link": "https://www.hepl.be/fr/jpo",
        "gallery": null,
        "created_at": null,
        "updated_at": null,
        "deleted_at": null
    },
    {
        "id": 2,
        "name": "Paris Web",
        "excerpt": "L’événement pour un web accessible et de qualité. De nombreuses conférences et activités vous y attendent !",
        "description": "Paris Web est une association française à but non lucratif, fondée en 2005 par Éric Daspet, Stéphane Deschamps et Adrien Leygues. Tous les ans, l’association organise un cycle de conférences et d’ateliers répartis sur trois jours à Paris.\n\nAu-delà de cette manifestation, le but de Paris Web est de promouvoir le développement web de qualité au sens large : standards, normes, accessibilité, ergonomie et méthodes de conception. Elle participe à des manifestations, des forums et fait la promotion des initiatives soutenant ces principes.\n\nL’objectif de l’association est de s’adresser à toutes les couches de la chaîne de production web : aux débutants comme aux experts, aux techniciens comme aux décideurs, aux créatifs comme aux qualiticiens. C’est pourquoi les thèmes abordés lors de la conférence se veulent éclectiques, du design au développement en passant par la gestion de projet, afin que chaque participant puisse tirer le meilleur parti de sa venue.\n\nCertains des plus grands noms de l’industrie web ont participé aux conférences ces dernières années, parmi lesquels des membres de Microsoft, Yahoo!, le W3C, Mozilla, Opera ou encore Dailymotion.\n\nL’édition 2008 de Paris Web avait notamment réussi à réunir autour de la table, pour la première fois dans une conférence, des représentants des 4 principaux navigateurs Web (IE 8, Firefox, Safari / Webkit, Opera) !",
        "lieu": "Paris",
        "link": "https://www.paris-web.fr/",
        "gallery": null,
        "created_at": null,
        "updated_at": null,
        "deleted_at": null
    },
    {
        "id": 3,
        "name": "Meta Connect",
        "excerpt": "Le but de cet événement web est d’explorer la construction du metaverse, son avenir et les dernières technologies déployées.",
        "description": "Meta Connect, un évènement virtuel d’une journée, vous présentera le futur du métavers ainsi que le futur de la réalité virtuelle et augmentée. Les leaders de l’industrie vous parleront des dernières technologies, tandis que les sessions développement se focaliseront sur leur mise en œuvre. Notre but est de rapprocher le monde et de resserrer les liens humains grâce à de nouvelles expériences.",
        "lieu": "Online",
        "link": "https://metaconnect.com/fr-fr/",
        "gallery": null,
        "created_at": null,
        "updated_at": null,
        "deleted_at": null
    }
]
