[
    {
        "id": 2,
        "name": "Open Door",
        "locale": "en",
        "excerpt": "The HEPL open house will allow you to visit the school of your choice and meet the teachers",
        "description": "The Open Day at the Parc des Marêts will take place on Saturday 30 April 2022. During this day, you will be able to meet the teachers of the option, former students who will be present to talk about their experiences but also all the teaching staff. You will be able to talk with them and ask all your questions.\n\nWe hope to see many of you there!",
        "lieu": "Liège",
        "link": "https://www.hepl.be/fr/jpo",
        "main_picture": "img-redimensions/porte-ouverte-picture.jpg",
        "pictures": null,
        "srcset": null,
        "gallery": null,
        "date": "2020-09-10 00:00:00",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "actuality_id" : 1
    },
    {
        "id": 1,
        "name": "Porte Ouverte",
        "locale": "fr",
        "excerpt": "Les portes ouvertes de la HEPL vous permettra de visiter l’école de votre choix et de rencontrer les professeurs",
        "description": "La journée Porte Ouverte au Parc des Marêts aura lieu ce samedi 30 avril 2022. Lors de cette journée, vous pourrez rencontrer les professeurs de l’option, des anciens étudiants qui seront présents pour parler de leur expériences mais également tout l’équipe pédagogique. Vous pourrez parler avec eux et posez toutes vos questions.\n\nNous espérons vous y voir nombreux ! ",
        "lieu": "Liège",
        "link": "https://www.hepl.be/fr/jpo",
        "main_picture": "img-redimensions/porte-ouverte-picture.jpg",
        "pictures": null,
        "srcset": null,
        "gallery": null,
        "date": "2020-09-10 00:00:00",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "actuality_id" : 1
    },
    {
        "id": 4,
        "name": "Paris Web",
        "locale": "en",
        "excerpt": "The event for an accessible and quality web. Numerous conferences and activities await you!",
        "description": "Paris Web is a French non-profit association, founded in 2005 by Éric Daspet, Stéphane Deschamps and Adrien Leygues. Every year, the association organises a cycle of conferences and workshops over three days in Paris.\n\nBeyond this event, the aim of Paris Web is to promote quality web development in the broadest sense: standards, norms, accessibility, ergonomics and design methods. It participates in events, forums and promotes initiatives supporting these principles.\n\nThe association's objective is to address all layers of the web production chain: beginners as well as experts, technicians as well as decision-makers, creatives as well as quality specialists.",
        "lieu": "Paris",
        "link": "https://www.paris-web.fr/",
        "main_picture": "img-redimensions/paris-web.jpg",
        "pictures": null,
        "srcset": null,
        "gallery": null,
        "date": "2020-09-10 00:00:00",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "actuality_id" : 2
    },
    {
        "id": 3,
        "name": "Paris Web",
        "locale": "fr",
        "excerpt": "L’événement pour un web accessible et de qualité. De nombreuses conférences et activités vous y attendent !",
        "description": "Paris Web est une association française à but non lucratif, fondée en 2005 par Éric Daspet, Stéphane Deschamps et Adrien Leygues. Tous les ans, l’association organise un cycle de conférences et d’ateliers répartis sur trois jours à Paris.\n\nAu-delà de cette manifestation, le but de Paris Web est de promouvoir le développement web de qualité au sens large : standards, normes, accessibilité, ergonomie et méthodes de conception. Elle participe à des manifestations, des forums et fait la promotion des initiatives soutenant ces principes.\n\nL’objectif de l’association est de s’adresser à toutes les couches de la chaîne de production web : aux débutants comme aux experts, aux techniciens comme aux décideurs, aux créatifs comme aux qualiticiens.",
        "lieu": "Paris",
        "link": "https://www.paris-web.fr/",
        "main_picture": "img-redimensions/paris-web.jpg",
        "pictures": null,
        "srcset": null,
        "gallery": null,
        "date": "2020-09-10 00:00:00",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "actuality_id" : 2
    },
    {
        "id": 6,
        "name": "Meta Connect",
        "locale": "en",
        "excerpt": "The aim of this web event is to explore the construction of the metaverse, its future and the latest technologies deployed.",
        "description": "Meta Connect, a one-day virtual event, will introduce you to the future of the metaverse and the future of virtual and augmented reality. Industry leaders will talk about the latest technologies, while development sessions will focus on their implementation. Our goal is to bring the world together and strengthen human connections through new experiences.",
        "lieu": "Online",
        "link": "https://metaconnect.com/fr-fr/",
        "main_picture": "img-redimensions/metaconnect.jpg",
        "pictures": null,
        "srcset": null,
        "gallery": null,
        "date": "2020-09-10 00:00:00",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "actuality_id" : 3
    },
    {
        "id": 5,
        "name": "Meta Connect",
        "locale": "fr",
        "excerpt": "Le but de cet événement web est d’explorer la construction du metaverse, son avenir et les dernières technologies déployées.",
        "description": "Meta Connect, un évènement virtuel d’une journée, vous présentera le futur du métavers ainsi que le futur de la réalité virtuelle et augmentée. Les leaders de l’industrie vous parleront des dernières technologies, tandis que les sessions développement se focaliseront sur leur mise en œuvre. Notre but est de rapprocher le monde et de resserrer les liens humains grâce à de nouvelles expériences.",
        "lieu": "En ligne",
        "link": "https://metaconnect.com/fr-fr/",
        "main_picture": "img-redimensions/metaconnect.jpg",
        "pictures": null,
        "srcset": null,
        "gallery": null,
        "date": "2020-09-10 00:00:00",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "actuality_id" : 3
    },
    {
        "id": 7,
        "name": "Meta Connect",
        "locale": "de",
        "excerpt": "Ziel dieses Web-Events ist es, den Aufbau des Metaversums, seine Zukunft und die neuesten eingesetzten Technologien zu erkunden.",
        "description": "Meta Connect, eine eintägige virtuelle Veranstaltung, wird Ihnen die Zukunft des Metaverse und die Zukunft der virtuellen und erweiterten Realität vorstellen. Branchenführer werden über die neuesten Technologien sprechen, während sich die Entwicklungssitzungen auf deren Umsetzung konzentrieren werden. Unser Ziel ist es, die Welt zusammenzubringen und menschliche Verbindungen durch neue Erfahrungen zu stärken.",
        "lieu": "Online",
        "link": "https://metaconnect.com/fr-fr/",
        "main_picture": "img-redimensions/metaconnect.jpg",
        "pictures": null,
        "srcset": null,
        "gallery": null,
        "date": "2020-09-10 00:00:00",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "actuality_id" : 3
    },
    {
        "id": 8,
        "name": "Paris Web",
        "locale": "de",
        "excerpt": "Die Veranstaltung für ein zugängliches und hochwertiges Web. Zahlreiche Konferenzen und Aktivitäten warten auf Sie!",
        "description": "Paris Web ist ein französischer gemeinnütziger Verein, der 2005 von Éric Daspet, Stéphane Deschamps und Adrien Leygues gegründet wurde. Jedes Jahr organisiert der Verein eine Reihe von Konferenzen und Workshops, die drei Tage lang in Paris stattfinden.\n\nÜber diese Veranstaltung hinaus ist es das Ziel von Paris Web, die Qualität der Webentwicklung im weitesten Sinne zu fördern: Standards, Normen, Zugänglichkeit, Ergonomie und Designmethoden. Der Verband nimmt an Veranstaltungen und Foren teil und fördert Initiativen, die diese Grundsätze unterstützen.\n\nDer Verband hat sich zum Ziel gesetzt, alle Ebenen der Web-Produktionskette anzusprechen: Anfänger wie Experten, Techniker wie Entscheidungsträger, Kreative wie Qualitätsspezialisten.",
        "lieu": "Paris",
        "link": "https://www.paris-web.fr/",
        "main_picture": "img-redimensions/paris-web.jpg",
        "pictures": null,
        "srcset": null,
        "gallery": null,
        "date": "2020-09-10 00:00:00",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "actuality_id" : 2
    },
    {
        "id": 9,
        "name": "Offene Tür",
        "locale": "de",
        "excerpt": "Der Tag der offenen Tür bei HEPL bietet Ihnen die Möglichkeit, die Schule Ihrer Wahl zu besuchen und die Lehrer kennenzulernen",
        "description": "Der Tag der offenen Tür im Parc des Marêts findet am Samstag, den 30. April 2022 statt. An diesem Tag können Sie die Lehrkräfte der Option, ehemalige Schüler, die über ihre Erfahrungen berichten werden, aber auch das gesamte Lehrpersonal kennenlernen. Sie können mit ihnen sprechen und alle Ihre Fragen stellen.\n\nWir hoffen, dass wir viele von Ihnen dort sehen werden!",
        "lieu": "Liège",
        "link": "https://www.hepl.be/fr/jpo",
        "main_picture": "img-redimensions/porte-ouverte-picture.jpg",
        "pictures": null,
        "srcset": null,
        "gallery": null,
        "date": "2020-09-10 00:00:00",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "actuality_id" : 1
    },
    {
        "id": 10,
        "name": "Meta Connect",
        "locale": "nl",
        "excerpt": "Het doel van dit webevenement is het verkennen van de structuur van de metaverse, de toekomst ervan en de nieuwste technologieën die worden gebruikt.",
        "description": "Meta Connect, een eendaags virtueel evenement, laat je kennismaken met de toekomst van de metaverse en de toekomst van virtuele en augmented reality. Industrieleiders zullen spreken over de nieuwste technologieën, terwijl de ontwikkelingssessies zich zullen toespitsen op de toepassing ervan. Ons doel is de wereld samen te brengen en menselijke banden te versterken door nieuwe ervaringen.",
        "lieu": "Online",
        "link": "https://metaconnect.com/fr-fr/",
        "main_picture": "img-redimensions/metaconnect.jpg",
        "pictures": null,
        "srcset": null,
        "gallery": null,
        "date": "2020-09-10 00:00:00",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "actuality_id" : 3
    },
    {
        "id": 11,
        "name": "Paris Web",
        "locale": "nl",
        "excerpt": "Het evenement voor een toegankelijk en hoogwaardig web. Talrijke conferenties en activiteiten wachten op u!",
        "description": "Paris Web is een Franse non-profitorganisatie die in 2005 is opgericht door Éric Daspet, Stéphane Deschamps en Adrien Leygues. Elk jaar organiseert de vereniging een reeks conferenties en workshops die drie dagen lang in Parijs plaatsvinden.\n\nNaast dit evenement is het doel van Paris Web het bevorderen van de kwaliteit van webontwikkeling in de breedste zin van het woord: normen, standaarden, toegankelijkheid, ergonomie en ontwerpmethoden. De vereniging neemt deel aan evenementen en fora en bevordert initiatieven die deze beginselen ondersteunen.\n\nDe vereniging richt zich op alle niveaus van de webproductieketen: Zowel beginners als deskundigen, zowel technici als besluitvormers, zowel creatieven als kwaliteitsspecialisten.",
        "lieu": "Paris",
        "link": "https://www.paris-web.fr/",
        "main_picture": "img-redimensions/paris-web.jpg",
        "pictures": null,
        "srcset": null,
        "gallery": null,
        "date": "2020-09-10 00:00:00",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "actuality_id" : 2
    },
    {
        "id": 12,
        "name": "Open de deur",
        "locale": "nl",
        "excerpt": "De HEPL Open Dag geeft je de mogelijkheid om de school van je keuze te bezoeken en de docenten te ontmoeten.",
        "description": "De Open Dag van Parc des Marêts vindt plaats op zaterdag 30 april 2022. Op deze dag kunt u de docenten van de optie ontmoeten, oud-studenten die over hun ervaringen zullen vertellen, maar ook al het onderwijzend personeel. Je kunt met ze praten en al je vragen stellen.\n\nWe hopen velen van jullie daar te zien!",
        "lieu": "Liège",
        "link": "https://www.hepl.be/fr/jpo",
        "main_picture": "img-redimensions/porte-ouverte-picture.jpg",
        "pictures": null,
        "srcset": null,
        "gallery": null,
        "date": "2020-09-10 00:00:00",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "actuality_id" : 1
    }
]
