[
    {
        "id": 2,
        "name": "Web Ergonomics & UX Design",
        "locale": "en",
        "excerpt": "Book needed in your first year.",
        "description": "FINALLY BE SUCCESSFUL WITH YOUR USERS!\nEvery digital service must succeed in the difficult challenge of satisfying its users. But how do you understand them and put yourself in their shoes? How do you design a site that is so pleasant and effective that it makes you want to come back? Thanks to Amélie Boucher's practical and methodological advice in this book, which has become the French reference, you can apply web ergonomics in the field!\n- Rules and theoretical foundations of usability (Gestalt theories, affordances, Fitts' law, etc.)\n- User research methods (observations, interviews, card sorting, user tests, personas, experience cards...)\n- Practical advice for information architecture, user paths and detailed design\nUX DESIGN BY EXAMPLE\n- Get inspired by real websites to improve your usability\n- 350+ illustrations to dissect good and bad practices\n- Interviews with professionals",
        "gallery": null,
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "book_id": 1
    },
    {
        "id": 1,
        "name": "Ergonomie Web & UX Design",
        "locale": "fr",
        "excerpt": "Livre nécessaire lors de votre première année. ",
        "description": "AYEZ ENFIN DU SUCCÈS AUPRÈS DE VOS UTILISATEURS !\nTout service numérique doit réussir le pari difficile de satisfaire ses utilisateurs. Mais comment bien comprendre ces derniers et se mettre à leur place ? Comment concevoir un site si agréable et efficace qu’il donne envie d’y revenir ? Grâce aux conseils pratiques et méthodologiques d’Amélie Boucher dans ce livre devenu désormais la référence francophone, appliquez l’ergonomie web sur le terrain !\n• Règles et fondements théoriques de l’ergonomie (théories de la Gestalt, affordances, loi de Fitts…)\n• Méthodes de recherche utilisateur (observations, interviews, tris de cartes, tests utilisateur, personas, cartes d’expérience…)\n• Conseils pratiques pour l’architecture de l’information, les parcours utilisateur et la conception détaillée\nL’UX DESIGN PAR L’EXEMPLE\n• Inspirez-vous de sites réels pour améliorer votre ergonomie\n• + de 350 illustrations pour décortiquer les bonnes et mauvaises pratiques\n• Des interviews de professionnels",
        "gallery": null,
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "book_id": 1
    },
    {
        "id": 4,
        "name": "HTML a reference for the developer",
        "locale": "en",
        "excerpt": "Book needed in your first year. ",
        "description": "This book sheds light on the challenging specifications of HTML 5 and explores all the new features and tags, including those that have evolved since previous versions. The author recalls the turbulent history of HTML 5 at the W3C and WhatWG, and explains how to design high-performance, accessible websites and applications, incorporate media elements (audio, video), create interactive drawing areas and animations with Canvas, and use microformats for semantic markup to improve data exchange and referencing. It goes into step-by-step detail on microformats, APIs for file management, geolocation, drag and drop support, and how to store local data in the browser, communicate in real time, or exchange documents using the advanced Web Storage, Web Sockets, Server-Sent Events, and Web Messaging APIs. Finally, it discusses Web Workers, allowing multithreaded JavaScript execution, SQL or NoSQL databases (Indexed Database and Web SQL Database), as well as an application cache for offline execution (Offline Web Applications), and advanced history manipulation (History API). Highly illustrated, rich in advice and best practices, the book is completed by a condensed reference on JavaScript and DOM management. The appendix includes an exhaustive chapter on ARIA and accessibility, as well as a list of obsolete HTML4 elements and a summary of CSS. Who is this book for? Web developers and integrators who wish to implement the new HTML 5 APIs and modernise their web development best practices; web designers who wish to discover all the possibilities offered by HTML5; all those who wish to acquire a coherent web development methodology, combining quality and accessibility.",
        "gallery": null,
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "book_id": 2
    },
    {
        "id": 3,
        "name": "HTML une référence pour le développeur",
        "locale": "fr",
        "excerpt": "Livre nécessaire lors de votre première année. ",
        "description": "Ce livre fait la lumière sur les spécifications ardues de HTML 5 dont il explore l'ensemble des nouveautés et des balises, y compris celles ayant évolué depuis les précédentes versions. Non sans avoir rappelé son histoire mouvementée au W3C et au WhatWG, l'auteur explique au fil des chapitres comment concevoir des sites et applications web performants et accessibles, et y incorporer des éléments médias (audio, vidéo), créer des zones de dessin intéractives et des animations avec Canvas, exploiter les microformats pour un balisage sémantique améliorant l'échange de données et le référencement. Il détaille pas à pas les microformats, les interfaces de programmation pour la gestion des fichiers, la géolocalisation, la prise en charge du glisser-déposer !Drag & Drop), et explique comment stocker des données locales dans le navigateur, communiquer en temps réel ou procéder à des échanges interdocuments grâce aux API avancées Web Storage, Web Sockets, Server-Sent Events et Web Messaging. Il aborde enfin les Web Workers, permettant d'exécuter du JavaScript en multithread, les bases de données SQL ou NoSQL (Indexed Database et Web SQL Database) ainsi qu'un cache d'application pour une exécution hors-ligne (Offline Web Applications), ou encore la manipulation avancée de l'historique (History API). Très illustré, riche en conseils et bonnes pratiques, l'ouvrage se complète d'une référence condensée sur JavaScript et sur la gestion du DOM. En annexe, un chapitre exhaustif sur ARIA et l'accessibilité ainsi que la liste des éléments HTML4 obsolètes et des rappels synthétiques sur les CSS. A qui s'adresse cet ouvrage ? Aux développeurs web, intégrateurs qui souhaitent mettre en oeuvre les nouvelles API de HTML 5 et moderniser leurs bonnes pratiques de développement web ; aux designers web qui souhaitent découvrir toutes les possibilités que leur offre HTML5 ; à tous ceux qui souhaitent acquérir une méthodologie cohérente de développement web, combinant qualité et accessibilité.",
        "gallery": null,
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "book_id": 2
    },
    {
        "id": 6,
        "name": "CSS Pocket Reference",
        "locale": "en",
        "excerpt": "Book needed in your first year.",
        "description": "When you're working with CSS and need a quick answer, CSS Pocket Reference is there for you. This handy, concise book provides all the essential information you need to implement CSS on the fly. Ideal for intermediate to advanced web designers and developers, the 4th edition is revised and updated for CSS3, the latest version of the Cascading Style Sheet specification. In addition to a comprehensive alphabetical reference to CSS3 selectors and properties, you will also find a brief introduction to key CSS concepts.",
        "gallery": null,
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "book_id": 3
    },
    {
        "id": 5,
        "name": "CSS Pocket Reference",
        "locale": "fr",
        "excerpt": "Livre nécessaire lors de votre première année.",
        "description": "Lorsque vous travaillez avec CSS et que vous avez besoin d'une réponse rapide, CSS Pocket Reference est là pour vous. Ce livre pratique et concis fournit toutes les informations essentielles dont vous avez besoin pour implémenter CSS à la volée. Idéale pour les concepteurs et développeurs Web intermédiaires à avancés, la 4e édition est révisée et mise à jour pour CSS3, la dernière version de la spécification Cascading Style Sheet. Outre une référence alphabétique complète aux sélecteurs et propriétés CSS3, vous trouverez également une brève introduction aux concepts clés de CSS.",
        "gallery": null,
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "book_id": 3
    },
    {
        "id": 8,
        "name": "HTML Pocket Reference",
        "locale": "en",
        "excerpt": "Book needed in your first year.",
        "description": "Detailed information on tag attributes Support information on browsers such as Netscape Navigator, Microsoft Internet Explorer, Opera and WebTV HTML 4.0 support information, including whether the tag is obsolete in the current specification In addition to tag-by-tag descriptions, you'll find useful graphics on topics such as :\n\n\nCharacter entities Decimal to hexadecimal conversions Color names Niederst also provides context for tags, indicating which tags are grouped together and rudimentary examples of how standard Web page elements are constructed.",
        "gallery": null,
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "book_id": 4
    },
    {
        "id": 7,
        "name": "HTML Pocket Reference",
        "locale": "fr",
        "excerpt": "Livre nécessaire lors de votre première année.",
        "description": "Des informations détaillées sur les attributs de la balise Des informations de support sur les navigateurs tels que Netscape Navigator, Microsoft Internet Explorer, Opera et WebTV Des informations de support HTML 4.0, y compris si la balise est obsolète dans la spécification actuelle En plus de balise-par- des descriptions de balises, vous trouverez des graphiques utiles sur des sujets tels que :\n\n\nEntités de caractères Conversions décimales en hexadécimales Noms de couleurs Niederst fournit également un contexte pour les balises, indiquant quelles balises sont regroupées et des exemples rudimentaires de la façon dont les éléments de page Web standard sont construit.",
        "gallery": null,
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "book_id": 4
    },
    {
        "id": 10,
        "name": "Flexbox",
        "locale": "en",
        "excerpt": "Book needed in your second year. ",
        "description": "Flexbox est en passe de révolutionner de manière profonde et pérenne notre façon de concevoir des designs et des composants en CSS. Pourquoi y consacrer un ouvrage ? Car, bien utilisé, Flexbox permet de faciliter la tâche de bon nombre de développeurs web.\n\nUn ouvrage de référence pour les webdesigners et intégrateurs\n\n\"Flexible Box Layout Module\", mieux connue sous le nom de \"Flexbox\", est une spécification CSS 3 du W3C qui définit un nouveau modèle de boîte et de positionnement jusqu'alors inédit. Il intègre une gestion naturelle de la fluidité des éléments et du Responsive, et rend caduc l'usage de grilles d'affichage complexes, voire de frameworks - véritables usines à gaz où l'on n'exploite qu'à peine 10% de l'outil. Oubliez donc tout ce que vous aviez appris sur CSS et, comme moi, tombez amoureux de Flexbox !\n\nOutre la simplification des schémas de positionnement, Flexbox apporte des solutions parfaites à une problématique bien ancrée dans notre époque : le Responsive Webdesign. Le design d'éléments flexibles, la réorganisation des blocs ainsi que la faculté à basculer très aisément d'un mode d'affichage horizontal vers un mode vertical en font un allié formidable dans nos projets d'adaptation aux tablettes et smartphones.",
        "gallery": null,
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "book_id": 5
    },
    {
        "id": 9,
        "name": "Flexbox",
        "locale": "fr",
        "excerpt": "Livre nécessaire lors de votre deuxième année. ",
        "description": "Flexbox est en passe de révolutionner de manière profonde et pérenne notre façon de concevoir des designs et des composants en CSS. Pourquoi y consacrer un ouvrage ? Car, bien utilisé, Flexbox permet de faciliter la tâche de bon nombre de développeurs web.\n\nUn ouvrage de référence pour les webdesigners et intégrateurs\n\n\"Flexible Box Layout Module\", mieux connue sous le nom de \"Flexbox\", est une spécification CSS 3 du W3C qui définit un nouveau modèle de boîte et de positionnement jusqu'alors inédit. Il intègre une gestion naturelle de la fluidité des éléments et du Responsive, et rend caduc l'usage de grilles d'affichage complexes, voire de frameworks - véritables usines à gaz où l'on n'exploite qu'à peine 10% de l'outil. Oubliez donc tout ce que vous aviez appris sur CSS et, comme moi, tombez amoureux de Flexbox !\n\nOutre la simplification des schémas de positionnement, Flexbox apporte des solutions parfaites à une problématique bien ancrée dans notre époque : le Responsive Webdesign. Le design d'éléments flexibles, la réorganisation des blocs ainsi que la faculté à basculer très aisément d'un mode d'affichage horizontal vers un mode vertical en font un allié formidable dans nos projets d'adaptation aux tablettes et smartphones.",
        "gallery": null,
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "book_id": 5
    },
    {
        "id": 12,
        "name": "Grid Layout",
        "locale": "en",
        "excerpt": "Book needed in your second year. ",
        "description": "Complementary to Flexbox, the Grid Layout module is a W3C specification in the Candidate Recommendation stage, the first drafts of which date back to 2004. Now usable in production on all browsers, the general concept of Grid Layout is to structure the space in major zones within a web page or an application. A virtual grid, independent of the HTML elements that can be placed on it, has the obvious advantage of being very flexible when you want to modify it according to the context.\n\nPerfectly adapted to responsive webdesign, Grid Layout allows your page to adapt immediately to different screen sizes. Combined with CSS 3 Media Queries, the grid layout model is very powerful, especially if you have opted for a template variant. Only the starting template needs to be modified: there is no need to intervene in the HTML structure, or even in the positioning of each page element.",
        "gallery": null,
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "book_id": 6
    },
    {
        "id": 11,
        "name": "Grid Layout",
        "locale": "fr",
        "excerpt": "Livre nécessaire lors de votre deuxième année. ",
        "description": "Complémentaire de Flexbox, le module de positionnement Grid Layout est une spécification du W3C à l'état de Candidate Recommandation dont les premiers jets datent de 2004. Désormais exploitable en production sur l'ensemble des navigateurs, le concept général de Grid Layout (ou \"positionnement en grille\") est de structurer l'espace en zones majeures, au sein d'une page web ou d'une application. Une grille virtuelle, indépendante des éléments HTML qui peuvent s'y placer, présente l'avantage flagrant d'être très souple lorsqu'on souhaite la modifier en fonction du contexte.\n\nParfaitement adapté au responsive webdesign, Grid Layout permet à votre page de s'adapter immédiatement aux différentes tailles d'écran. Associé aux CSS 3 Media Queries, le modèle de positionnement en grille donne toute sa puissance, plus particulièrement si vous avez opté pour une trame sous forme de variante \"template\". Seul le patron de départ nécessite d'être modifié : inutile d'intervenir sur la structure HTML, ni même sur le positionnement de chaque élément de page.",
        "gallery": null,
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "book_id": 6
    },
    {
        "id": 14,
        "name": "Responsive Web Design",
        "locale": "en",
        "excerpt": "Book needed in your second year. ",
        "description": "Are your designs ready? Learn how to think beyond the desktop and create great designs that anticipate and meet the needs of your users. Ethan Marcotte will explore CSS techniques and design principles, including fluid grids, flexible images, and multimedia queries, demonstrating how you can deliver a quality experience to your users, no matter how big (or small) their display.",
        "gallery": null,
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "book_id": 7
    },
    {
        "id": 13,
        "name": "Responsive Web Design",
        "locale": "fr",
        "excerpt": "Livre nécessaire lors de votre deuxième année. ",
        "description": "navigateurs. Vos créations sont-elles prêtes ? Apprenez à penser au-delà du bureau et à créer de superbes conceptions qui anticipent et répondent aux besoins de vos utilisateurs. Ethan Marcotte explorera les techniques CSS et les principes de conception, y compris les grilles fluides, les images flexibles et les requêtes multimédias, démontrant comment vous pouvez offrir une expérience de qualité à vos utilisateurs, quelle que soit la taille (ou la taille) de leur affichage.",
        "gallery": null,
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "book_id": 7
    },
    {
        "id": 15,
        "name": "Web Ergonomics & UX Design",
        "locale": "de",
        "excerpt": "Buch im ersten Jahr erforderlich.",
        "description": "SEIEN SIE ENDLICH ERFOLGREICH BEI IHREN NUTZERN!\nJeder digitale Dienst muss die schwierige Herausforderung meistern, seine Nutzer zufrieden zu stellen. Aber wie kann man sie verstehen und sich in ihre Lage versetzen? Wie gestaltet man eine Website, die so angenehm und effizient ist, dass man gerne wiederkommt? Dank der praktischen und methodischen Ratschläge von Amélie Boucher in diesem Buch, das zur französischen Referenz geworden ist, können Sie die Web-Ergonomie in der Praxis anwenden!\n- Regeln und theoretische Grundlagen der Benutzerfreundlichkeit (Gestalttheorien, Affordanzen, Fitts'sches Gesetz, usw.)\n- Methoden der Nutzerforschung (Beobachtungen, Interviews, Kartensortierung, Nutzertests, Personas, Erfahrungskarten...)\n- Praktische Ratschläge für Informationsarchitektur, Benutzerpfade und detailliertes Design\nUX DESIGN ANHAND VON BEISPIELEN\n- Lassen Sie sich von echten Websites inspirieren, um Ihre Benutzerfreundlichkeit zu verbessern\n- Über 350 Illustrationen, die gute und schlechte Praktiken aufschlüsseln\n- Interviews mit Fachleuten",
        "gallery": null,
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "book_id": 1
    },
    {
        "id": 16,
        "name": "Responsive Web Design",
        "locale": "de",
        "excerpt": "Buch im zweiten Jahr erforderlich.",
        "description": "Sind Ihre Designs bereit? Lernen Sie, wie Sie über den Desktop hinaus denken und großartige Designs erstellen können, die die Bedürfnisse Ihrer Nutzer vorhersehen und erfüllen. Ethan Marcotte wird CSS-Techniken und Designprinzipien erforschen, einschließlich fließender Raster, flexibler Bilder und Multimedia-Abfragen, und zeigen, wie Sie Ihren Nutzern ein hochwertiges Erlebnis bieten können, unabhängig davon, wie groß (oder klein) ihr Bildschirm ist.",
        "gallery": null,
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "book_id": 7
    },
    {
        "id": 17,
        "name": "HTML a reference for the developer",
        "locale": "de",
        "excerpt": "Buch wird im ersten Jahr benötigt. ",
        "description": "Dieses Buch beleuchtet die anspruchsvollen Spezifikationen von HTML 5 und erforscht alle neuen Funktionen und Tags, einschließlich derer, die sich seit den vorherigen Versionen weiterentwickelt haben. Der Autor erinnert an die turbulente Geschichte von HTML 5 beim W3C und der WhatWG und erklärt, wie man leistungsstarke, barrierefreie Websites und Anwendungen entwirft, Medienelemente (Audio, Video) einbindet, interaktive Zeichenflächen und Animationen mit Canvas erstellt und Mikroformate für semantisches Markup verwendet, um den Datenaustausch und die Referenzierung zu verbessern. Schritt für Schritt werden Mikroformate, APIs für die Dateiverwaltung, Geolokalisierung, Drag-and-Drop-Unterstützung und die Speicherung lokaler Daten im Browser, die Kommunikation in Echtzeit oder der Austausch von Dokumenten mithilfe der erweiterten Web Storage, Web Sockets, Server-Sent Events und Web Messaging APIs erläutert. Schließlich werden Web Worker, die eine Multithreading-JavaScript-Ausführung ermöglichen, SQL- oder NoSQL-Datenbanken (Indexed Database und Web SQL Database) sowie ein Anwendungscache für die Offline-Ausführung (Offline Web Applications) und eine erweiterte Verlaufsmanipulation (History API) behandelt. Das reich bebilderte Buch ist reich an Ratschlägen und Best Practices und wird durch eine komprimierte Referenz zu JavaScript und DOM-Management ergänzt. Der Anhang enthält ein ausführliches Kapitel über ARIA und Barrierefreiheit sowie eine Liste veralteter HTML4-Elemente und eine Zusammenfassung von CSS. Für wen ist dieses Buch gedacht? Webentwickler und -integratoren, die die neuen HTML5-APIs implementieren und ihre Best Practices für die Webentwicklung modernisieren möchten; Webdesigner, die alle Möglichkeiten von HTML5 entdecken möchten; alle, die eine kohärente Webentwicklungsmethodik erwerben möchten, die Qualität und Zugänglichkeit vereint.",
        "gallery": null,
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "book_id": 2
    },
    {
        "id": 18,
        "name": "CSS Pocket Reference",
        "locale": "de",
        "excerpt": "Buch wird im ersten Jahr benötigt.",
        "description": "Wenn Sie mit CSS arbeiten und eine schnelle Antwort brauchen, ist die CSS Pocket Reference für Sie da. Dieses handliche, prägnante Buch bietet alle wichtigen Informationen, die Sie benötigen, um CSS spontan zu implementieren. Die 4. Auflage ist ideal für fortgeschrittene Webdesigner und -entwickler und wurde für CSS3, die neueste Version der Cascading Style Sheet-Spezifikation, überarbeitet und aktualisiert. Neben einer umfassenden alphabetischen Referenz zu CSS3-Selektoren und -Eigenschaften finden Sie auch eine kurze Einführung in die wichtigsten CSS-Konzepte.",
        "gallery": null,
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "book_id": 3
    },
    {
        "id": 19,
        "name": "HTML Pocket Reference",
        "locale": "de",
        "excerpt": "Buch wird im ersten Jahr benötigt.",
        "description": "Detaillierte Informationen zu Tag-Attributen Informationen zur Unterstützung von Browsern wie Netscape Navigator, Microsoft Internet Explorer, Opera und WebTV Informationen zur Unterstützung von HTML 4.0, einschließlich der Angabe, ob das Tag in der aktuellen Spezifikation veraltet ist Zusätzlich zu den Beschreibungen der einzelnen Tags finden Sie nützliche Grafiken zu Themen wie:\n\n\nZeicheneinheiten Umwandlung von Dezimal- in Hexadezimalzeichen Farbnamen Niederst bietet auch Kontext für Tags, indem er angibt, welche Tags zusammen gruppiert sind und rudimentäre Beispiele für den Aufbau von Standard-Webseitenelementen.",
        "gallery": null,
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "book_id": 4
    },
    {
        "id": 20,
        "name": "Flexbox",
        "locale": "de",
        "excerpt": "Buch im zweiten Jahr erforderlich. ",
        "description": "Flexbox ist auf dem besten Weg, unsere Art, Designs und Komponenten in CSS zu entwerfen, grundlegend und dauerhaft zu revolutionieren. Warum sollte man ihr ein Buch widmen? Weil Flexbox, wenn es richtig eingesetzt wird, vielen Webentwicklern die Arbeit erleichtert.\n\nEin Standardwerk für Webdesigner und Integratoren\n\n\"Flexible Box Layout Module\", besser bekannt als \"Flexbox\", ist eine CSS-3-Spezifikation des W3C, die ein neues, bislang unbekanntes Box- und Positionierungsmodell definiert. Es beinhaltet eine natürliche Verwaltung von flüssigen Elementen und Responsive und macht die Verwendung von komplexen Anzeigerastern oder gar Frameworks überflüssig - wahre Gaswerke, bei denen man nur knapp 10% des Werkzeugs nutzen kann. Vergessen Sie also alles, was Sie bisher über CSS gelernt haben, und verlieben Sie sich wie ich in Flexbox!\n\nNeben der Vereinfachung von Positionierungsschemata bietet Flexbox perfekte Lösungen für ein Problem, das tief in unserer Zeit verwurzelt ist: Responsive Webdesign. Das flexible Elementdesign, die Neuorganisation von Blöcken und die Möglichkeit, ganz einfach zwischen horizontaler und vertikaler Darstellung zu wechseln, machen Flexflex zu einem großartigen Verbündeten bei der Anpassung an Tablets und Smartphones.",
        "gallery": null,
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "book_id": 5
    },
    {
        "id": 21,
        "name": "Grid Layout",
        "locale": "de",
        "excerpt": "Buch im zweiten Jahr erforderlich. ",
        "description": "Ergänzend zu Flexbox ist das Grid-Layout-Modul eine W3C-Spezifikation im Stadium der Candidate Recommendation, deren erste Entwürfe auf das Jahr 2004 zurückgehen. Das allgemeine Konzept des Grid-Layouts, das inzwischen in allen Browsern in der Produktion eingesetzt werden kann, besteht darin, den Raum in wichtigen Bereichen einer Webseite oder einer Anwendung zu strukturieren. Ein virtuelles Raster, unabhängig von den HTML-Elementen, die darauf platziert werden können, hat den offensichtlichen Vorteil, dass es sehr flexibel ist, wenn man es je nach Kontext ändern möchte.\n\nDas Grid-Layout ist perfekt an das responsive Webdesign angepasst und ermöglicht die sofortige Anpassung Ihrer Seite an unterschiedliche Bildschirmgrößen. In Kombination mit CSS 3 Media Queries ist das Grid-Layout-Modell sehr leistungsfähig, insbesondere wenn Sie sich für eine Template-Variante entschieden haben. Es muss nur die Ausgangsvorlage geändert werden: Es besteht keine Notwendigkeit, in die HTML-Struktur oder gar in die Positionierung der einzelnen Seitenelemente einzugreifen.",
        "gallery": null,
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "book_id": 6
    },
    {
        "id": 22,
        "name": "Web Ergonomics & UX Design",
        "locale": "nl",
        "excerpt": "Boek vereist in het eerste jaar.",
        "description": "EINDELIJK SUCCES HEBBEN MET UW GEBRUIKERS!\nElke digitale dienst moet de moeilijke uitdaging aangaan om zijn gebruikers tevreden te stellen. Maar hoe kun je ze begrijpen en je in hun schoenen verplaatsen? Hoe ontwerp je een website die zo aangenaam en efficiënt is dat mensen terug willen komen? Dankzij de praktische en methodische adviezen van Amélie Boucher in dit boek, dat een Franse referentie is geworden, kunt u webergonomie in de praktijk brengen!\n- Regels en theoretische grondslagen van bruikbaarheid (ontwerptheorieën, affordances, de wet van Fitts, enz.)\n- Methoden van gebruikersonderzoek (observaties, interviews, card sorting, gebruikerstests, persona's, experience maps...)\n- Praktisch advies voor informatiearchitectuur, gebruikerspaden en gedetailleerd ontwerp\nUX DESIGN BY EXAMPLE\n- Doe inspiratie op bij echte websites om uw gebruikerservaring te verbeteren\n- Meer dan 350 illustraties waarin goede en slechte praktijken worden beschreven\n- Interviews met deskundigen",
        "gallery": null,
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "book_id": 1
    },
    {
        "id": 23,
        "name": "Responsive Web Design",
        "locale": "nl",
        "excerpt": "Boek vereist in het tweede jaar.",
        "description": "Zijn je ontwerpen klaar? Leer hoe u verder kunt denken dan de desktop en geweldige ontwerpen kunt maken die anticiperen op en voldoen aan de behoeften van uw gebruikers. Ethan Marcotte verkent CSS-technieken en ontwerpprincipes, waaronder vloeiende rasters, flexibele afbeeldingen en multimedia queries, en laat zien hoe u uw gebruikers een kwaliteitservaring kunt bieden, ongeacht hoe groot (of klein) hun scherm is..",
        "gallery": null,
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "book_id": 7
    },
    {
        "id": 24,
        "name": "HTML a reference for the developer",
        "locale": "nl",
        "excerpt": "Boek is vereist in het eerste jaar. ",
        "description": "Dit boek belicht de uitdagende specificaties van HTML 5 en verkent alle nieuwe functies en tags, inclusief die welke sinds vorige versies zijn geëvolueerd. De auteur memoreert de turbulente geschiedenis van HTML 5 bij het W3C en WhatWG en legt uit hoe je krachtige, toegankelijke websites en toepassingen ontwerpt, media-elementen (audio, video) insluit, interactieve artboards en animaties maakt met Canvas, en microformats gebruikt voor semantische opmaak om het delen van gegevens en het verwijzen ernaar te verbeteren. Stap voor stap worden microformats, API's voor bestandsbeheer, geolocatie, drag-and-drop ondersteuning en het opslaan van lokale gegevens in de browser, het communiceren in real time of het uitwisselen van documenten met behulp van de geavanceerde Web Storage, Web Sockets, Server-Sent Events en Web Messaging API's uitgelegd. Ten slotte worden Web Workers behandeld die multithreaded JavaScript-uitvoering, SQL- of NoSQL-databases (Indexed Database en Web SQL Database), alsmede een toepassingscache voor offline uitvoering (Offline Web Applications) en geavanceerde geschiedenismanipulatie (History API) mogelijk maken. Het rijk geïllustreerde boek is rijk aan advies en beste praktijken en wordt aangevuld met een beknopte referentie over JavaScript en DOM-beheer. De bijlage bevat een uitgebreid hoofdstuk over ARIA en toegankelijkheid, alsmede een lijst van verouderde HTML4-elementen en een overzicht van CSS. Voor wie is dit boek? Webontwikkelaars en integratoren die de nieuwe HTML5 API's willen implementeren en hun best practices voor webontwikkeling willen moderniseren; webdesigners die alle mogelijkheden van HTML5 willen ontdekken; iedereen die zich een coherente webontwikkelingsmethode eigen wil maken die kwaliteit en toegankelijkheid combineert.",
        "gallery": null,
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "book_id": 2
    },
    {
        "id": 25,
        "name": "CSS Pocket Reference",
        "locale": "nl",
        "excerpt": "Boek is vereist in het eerste jaar.",
        "description": "Als u met CSS werkt en snel een antwoord nodig hebt, is de CSS Pocket Reference iets voor u. Dit handige, beknopte boek biedt alle essentiële informatie die u nodig hebt om CSS on the fly te implementeren. De 4e editie is ideaal voor gevorderde webontwerpers en -ontwikkelaars en is herzien en bijgewerkt voor CSS3, de nieuwste versie van de Cascading Style Sheet-specificatie. Naast een uitgebreide alfabetische verwijzing naar CSS3-selectors en -eigenschappen vindt u ook een korte inleiding tot de belangrijkste CSS-concepten.",
        "gallery": null,
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "book_id": 3
    },
    {
        "id": 26,
        "name": "HTML Pocket Reference",
        "locale": "nl",
        "excerpt": "Boek is vereist in het eerste jaar.",
        "description": "Gedetailleerde informatie over tag-attributen Informatie over ondersteuning voor browsers zoals Netscape Navigator, Microsoft Internet Explorer, Opera en WebTV Informatie over ondersteuning voor HTML 4.0, inclusief of de tag in de huidige specificatie verouderd is Naast beschrijvingen van afzonderlijke tags vindt u nuttige grafieken over onderwerpen als:\n\n\nTekeneenheden Decimale naar hexadecimale tekenconversie Kleurnamen Niederst biedt ook context voor tags door aan te geven welke tags gegroepeerd zijn en rudimentaire voorbeelden van de structuur van standaard webpagina-elementen.",
        "gallery": null,
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "book_id": 4
    },
    {
        "id": 27,
        "name": "Flexbox",
        "locale": "nl",
        "excerpt": "Boek vereist in het tweede jaar. ",
        "description": "Flexbox is goed op weg om de manier waarop we ontwerpen en componenten maken in CSS fundamenteel en permanent te veranderen. Waarom er een boek aan wijden? Omdat Flexbox, mits goed gebruikt, het werk van veel webontwikkelaars vergemakkelijkt.\n\nEen standaardwerk voor webdesigners en integratoren\n\n\"Flexible Box Layout Module\", beter bekend als \"Flexbox\", is een CSS 3-specificatie van het W3C die een nieuw, voorheen onbekend box- en positioneringsmodel definieert. Het omvat een natuurlijk beheer van vloeiende elementen en Responsive en elimineert de noodzaak van complexe weergavegrids of zelfs kaders - echte gaswerken waar u nauwelijks 10% van het gereedschap kunt gebruiken. Dus vergeet alles wat je tot nu toe over CSS hebt geleerd en word verliefd op Flexbox zoals ik deed!\n\nNaast het vereenvoudigen van positioneringsschema's, biedt Flexbox perfecte oplossingen voor een probleem dat diep in onze tijd geworteld is: responsive web design. Het flexibele elementontwerp, de reorganisatie van blokken en de mogelijkheid om gemakkelijk te schakelen tussen horizontale en verticale weergave maken Flexflex een geweldige bondgenoot bij de aanpassing aan tablets en smartphones.",
        "gallery": null,
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "book_id": 5
    },
    {
        "id": 28,
        "name": "Grid Layout",
        "locale": "nl",
        "excerpt": "Boek vereist in het tweede jaar. ",
        "description": "Als aanvulling op Flexbox is de module Grid Layout een W3C-specificatie in het stadium van kandidaat-aanbeveling, waarvan de eerste ontwerpen dateren van 2004. Het algemene concept van rasterindeling, dat nu in productie in alle browsers kan worden gebruikt, is het structureren van de ruimte in belangrijke gebieden van een webpagina of -toepassing. Een virtueel raster, onafhankelijk van de HTML-elementen die erop kunnen worden geplaatst, heeft het voor de hand liggende voordeel dat het zeer flexibel is als je het wilt veranderen afhankelijk van de context.\n\nDe rasterindeling is perfect aangepast aan responsief webdesign en laat u toe uw pagina onmiddellijk aan te passen aan verschillende schermformaten. In combinatie met CSS 3 Media Queries is het grid layout model zeer krachtig, vooral als je een template variant hebt gekozen. Alleen het oorspronkelijke sjabloon moet worden gewijzigd: Er hoeft niet te worden ingegrepen in de HTML-structuur of zelfs in de positionering van de afzonderlijke pagina-elementen.",
        "gallery": null,
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "book_id": 6
    }
]
