[
    {
        "id": 1,
        "name": "Accessibilité",
        "locale": "fr",
        "definition": "1. Caractère de quelque chose, d’un lieu qui sont accessibles : L’accessibilité d’un bus, d’un immeuble aux handicapés.\n\n2. Droit, possibilité qu’a quelqu’un d’avoir accès à quelque chose : L’accessibilité à un emploi.",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 1
    },
    {
        "id": 2,
        "name": "Accessibility",
        "locale": "en",
        "definition": "1. The character of something or a place that is accessible: The accessibility of a bus, a building to the disabled.\n\n2. Right, possibility that someone has to have access to something: Accessibility to a job.",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 1
    },
    {
        "id": 3,
        "name": "Back-end",
        "locale": "fr",
        "definition": "Ensemble des parties de construction d’un site web qui abrite notamment le développement des bases de données. Invisible, l’utilisateur ne le voit pas.",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 2
    },
    {
        "id": 4,
        "name": "Back-end",
        "locale": "en",
        "definition": "A set of parts of the construction of a website that includes the development of databases. Invisible, the user does not see it.",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 2
    },
    {
        "id": 5,
        "name": "Efficience",
        "locale": "fr",
        "definition": "L’efficience est la capacité d’un individu ou d’un système de travail d’obtenir de bonnes performances dans un type de tâche donné.",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 3
    },
    {
        "id": 6,
        "name": "Efficiency",
        "locale": "en",
        "definition": "Efficiency is the ability of an individual or a work system to perform well in a given type of task.",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 3
    },
    {
        "id": 7,
        "name": "Efficacité",
        "locale": "fr",
        "definition": "L’efficacité est la capacité, d’une personne, d’un groupe ou d’un système, à parvenir à ses fins, à ses objectifs.",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 4
    },
    {
        "id": 8,
        "name": "Effectiveness",
        "locale": "en",
        "definition": "Effectiveness is the ability of a person, a group or a system to achieve its ends, its objectives.",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 4
    },
    {
        "id": 9,
        "name": "CMS",
        "locale": "fr",
        "definition": "Content Management System, regroupement de solutions permettant de créer, gérer et mettre à un jour un site Internet (Exemple : WordPress).",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 5
    },
    {
        "id": 10,
        "name": "CMS",
        "locale": "en",
        "definition": "Content Management System, group of solutions allowing to create, manage and update a website (Example: WordPress).",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 5
    },
    {
        "id": 11,
        "name": "CSS",
        "locale": "fr",
        "definition": "Acronyme de Cascading Style Sheets. C’est un langage informatique utilisé sur internet pour la mise en forme de fichiers et pages HTML.",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 6
    },
    {
        "id": 12,
        "name": "CSS",
        "locale": "en",
        "definition": "Acronym for Cascading Style Sheets. It is a computer language used on the Internet for formatting HTML files and pages..",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 6
    },
    {
        "id": 13,
        "name": "Modularisation",
        "locale": "fr",
        "definition": "La modularisation consiste à découper des formations en modules distincts et permet de structurer des parcours qui tiennent compte à la fois des objectifs de formation et des acquis de l’apprenant. Elle est une condition essentielle de l’Individualisation des Parcours.",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 7
    },
    {
        "id": 14,
        "name": "Modularisation",
        "locale": "en",
        "definition": "Modularisation consists in dividing training courses into distinct modules and allows the structuring of courses that take into account both the training objectives and the learner's prior learning. It is an essential condition for the Individualisation of Pathways.",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 7
    },
    {
        "id": 15,
        "name": "Call To Action",
        "locale": "fr",
        "definition": "Un CTA ou Call to Action est un bouton contenant un texte incitant l’utilisateur à cliquer dessus. Généralement utilisé par un site pour pour diriger l’utilisateur vers une conversion.",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 8
    },
    {
        "id": 16,
        "name": "Call To Action",
        "locale": "en",
        "definition": "A CTA or Call to Action is a button containing text that prompts the user to click on it. Generally used by a website to direct the user to a conversion.",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 8
    },
    {
        "id": 17,
        "name": "Framework",
        "locale": "fr",
        "definition": "Désigne un ensemble d’outils et de composants logiciels à la base d’un logiciel ou une application. Il établit la fondation d’un logiciel ou son squelette applicatif.",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 9
    },
    {
        "id": 18,
        "name": "Framework",
        "locale": "en",
        "definition": "A set of software tools and components that form the basis of a software program or application. It establishes the foundation of a software or its application skeleton.",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 9
    },
    {
        "id": 19,
        "name": "Tagline",
        "locale": "fr",
        "definition": "La tagline, associé au titre du site, définit l’identité de ce site. Alors que le titre résume de quoi parle le site, le slogan développe le titre dans une phrase descriptive en renseignant davantage sur l’activité de l’entreprise.",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 10
    },
    {
        "id": 20,
        "name": "Tagline",
        "locale": "en",
        "definition": "The tagline, associated with the title of the site, defines the identity of the site. While the title summarises what the site is about, the tagline expands on the title in a descriptive sentence by providing more information about the company's activity.",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 10
    },
    {
        "id": 21,
        "name": "Erreichbarkeit",
        "locale": "de",
        "definition": "1. Die Eigenschaft von etwas oder einem Ort, der zugänglich ist: Die Zugänglichkeit eines Busses, eines Gebäudes für Behinderte.\n\n2. Recht, Möglichkeit, dass jemand Zugang zu etwas hat: Zugänglichkeit zu einem Arbeitsplatz.",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 1
    },
    {
        "id": 22,
        "name": "Back-end",
        "locale": "de",
        "definition": "Eine Reihe von Teilen der Konstruktion einer Website, die die Entwicklung von Datenbanken umfasst. Unsichtbar, der Benutzer sieht es nicht.",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 2
    },
    {
        "id": 23,
        "name": "Wirkungsgrad",
        "locale": "de",
        "definition": "Effizienz ist die Fähigkeit einer Person oder eines Arbeitssystems, bei einer bestimmten Art von Aufgabe gute Leistungen zu erbringen.",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 3
    },
    {
        "id": 24,
        "name": "Effektivität",
        "locale": "de",
        "definition": "Effektivität ist die Fähigkeit einer Person, einer Gruppe oder eines Systems, ihre Ziele zu erreichen.",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 4
    },
    {
        "id": 25,
        "name": "CMS",
        "locale": "de",
        "definition": "Content Management System, eine Gruppe von Lösungen zur Erstellung, Verwaltung und Aktualisierung einer Website (Beispiel: WordPress).",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 5
    },
    {
        "id": 28,
        "name": "Modularisierung",
        "locale": "de",
        "definition": "Die Modularisierung besteht in der Unterteilung von Ausbildungskursen in verschiedene Module und ermöglicht die Strukturierung von Kursen, die sowohl die Ausbildungsziele als auch die Vorkenntnisse der Lernenden berücksichtigen. Sie ist eine wesentliche Voraussetzung für die Individualisierung von Bildungswegen.",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 7
    },
    {
        "id": 29,
        "name": "Aufruf zum Handeln",
        "locale": "de",
        "definition": "Ein CTA oder Call to Action ist eine Schaltfläche, die einen Text enthält, der den Nutzer auffordert, darauf zu klicken. Sie wird in der Regel auf einer Website verwendet, um den Nutzer zu einer Umwandlung zu bewegen.",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 8
    },
    {
        "id": 30,
        "name": "Rahmenwerk",
        "locale": "de",
        "definition": "Eine Reihe von Software-Tools und -Komponenten, die die Grundlage für ein Softwareprogramm oder eine Anwendung bilden. Sie bilden das Fundament einer Software oder ihres Anwendungsskeletts.",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 9
    },
    {
        "id": 31,
        "name": "Tagline",
        "locale": "nl",
        "definition": "De tagline, die gekoppeld is aan de titel van de website, bepaalt de identiteit van de website. De titel vat samen waar de website over gaat, terwijl de tagline in een beschrijvende zin voortborduurt op de titel door meer informatie te geven over wat het bedrijf doet.",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 10
    },
    {
        "id": 32,
        "name": "Toegankelijkheid",
        "locale": "nl",
        "definition": "1. de eigenschap van iets of een plaats die toegankelijk is: de toegankelijkheid van een bus, een gebouw voor gehandicapten.\n\n2. recht, mogelijkheid voor iemand om toegang tot iets te hebben: Toegankelijkheid van een werkplek.",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 1
    },
    {
        "id": 33,
        "name": "Back-end",
        "locale": "nl",
        "definition": "Een reeks onderdelen van de bouw van een website die de ontwikkeling van databases omvat. Onzichtbaar, de gebruiker ziet het niet.",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 2
    },
    {
        "id": 34,
        "name": "Efficiëntie",
        "locale": "nl",
        "definition": "Efficiëntie is het vermogen van een persoon of een werksysteem om een bepaald soort taak goed uit te voeren.",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 3
    },
    {
        "id": 35,
        "name": "Doeltreffendheid",
        "locale": "nl",
        "definition": "Doeltreffendheid is het vermogen van een persoon, groep of systeem om zijn doelen te bereiken.",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 4
    },
    {
        "id": 36,
        "name": "CMS",
        "locale": "nl",
        "definition": "Contentmanagementsysteem, een groep oplossingen voor het maken, beheren en bijwerken van een website (voorbeeld: WordPress).",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 5
    },
    {
        "id": 37,
        "name": "Modularisering",
        "locale": "nl",
        "definition": "Modularisering bestaat in de opdeling van opleidingen in verschillende modules en maakt het mogelijk opleidingen te structureren die rekening houden met zowel de opleidingsdoelstellingen als de voorkennis van de lerenden. Het is een essentiële voorwaarde voor de individualisering van opleidingstrajecten.",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 7
    },
    {
        "id": 38,
        "name": "Oproep tot actie",
        "locale": "nl",
        "definition": "Een CTA of Call to Action is een knop met tekst die de gebruiker ertoe aanzet erop te klikken. Hij wordt meestal gebruikt op een website om de gebruiker aan te zetten tot conversie.",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 8
    },
    {
        "id": 39,
        "name": "Kader",
        "locale": "nl",
        "definition": "Een verzameling softwarehulpmiddelen en -componenten die de basis vormen voor een softwareprogramma of -toepassing. Zij vormen het fundament van een software of het toepassingsskelet ervan.",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 9
    },
    {
        "id": 40,
        "name": "Tagline",
        "locale": "nl",
        "definition": "De tagline, die gekoppeld is aan de titel van de website, bepaalt de identiteit van de website. De titel vat samen waar de website over gaat, terwijl de tagline in een beschrijvende zin voortborduurt op de titel door meer informatie te geven over wat het bedrijf doet.",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 10
    },
    {
        "id": 41,
        "name": "CSS",
        "locale": "de",
        "definition": "Akronym für Cascading Style Sheets. Es handelt sich um eine Computersprache, die im Internet zur Formatierung von HTML-Dateien und -Seiten verwendet wird.",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 6
    },
    {
        "id": 42,
        "name": "CSS",
        "locale": "nl",
        "definition": "Acroniem voor Cascading Style Sheets. Het is een computertaal die op het internet wordt gebruikt voor het opmaken van HTML-bestanden en pagina's..",
        "created_at": null,
        "updated_at": null,
        "deleted_at": null,
        "glossary_id": 6
    }
]
